#include "node.h"

/***********************************************************************
  Задача 1. Да се дефинира функция fillgaps, която приема като
  единствен параметър указател към линеен едносвързан списък от цели
  числа, наредени в нарастващ ред. Функцията да вмъква между всеки два
  съседни елемента a и b, такива че b – a > 1, числата a + 1, a + 2,
  ..., b, така че елементите на списъка да образуват редицата от
  поредните цели числа в интервала между първия и последния елемент на
  списъка.
************************************************************************/

/***********************************************************************
 РЕШЕНИЕ:
************************************************************************/

void fillgaps(node<int>* l);

/***********************************************************************
 КРАЙ НА РЕШЕНИЕТО
************************************************************************/

#define DOCTEST_CONFIG_IMPLEMENT
#include "doctest.h"

/***********************************************************************
  РАЗКОМЕНТИРАЙТЕ СЛЕДВАЩИЯ РЕД, ЗА ДА ВКЛЮЧИТЕ ТЕСТОВЕТЕ
************************************************************************/
//#include "prob1_tests.h"

int main ()
{
    // пускане на тестовете
    doctest::Context().run();
    return 0;
}
