#include "node.h"

/***********************************************************************
  Задача 2. Да се дефинира функция removeIdx, която приема като
  единствен параметър указател към линеен едносвързан списък от цели
  числа. Функцията да премахва от списъка всички елементи, които са
  равни на разликата между индекса на последния елемент и индекса на
  самия елемент.
************************************************************************/

/***********************************************************************
 РЕШЕНИЕ:
************************************************************************/

void removeIdx(node<int>*& l);

/***********************************************************************
 КРАЙ НА РЕШЕНИЕТО
************************************************************************/

#define DOCTEST_CONFIG_IMPLEMENT
#include "doctest.h"

/***********************************************************************
  РАЗКОМЕНТИРАЙТЕ СЛЕДВАЩИЯ РЕД, ЗА ДА ВКЛЮЧИТЕ ТЕСТОВЕТЕ
************************************************************************/
//#include "prob2_tests.h"

int main ()
{
    // пускане на тестовете
    doctest::Context().run();
    return 0;
}
